# Custom taps
tap "FelixKratz/formulae"

# Core tools
brew "wget"
brew "curl"
brew "git"
brew "git-delta"
brew "watch"
brew "tree"
brew "chezmoi"

# Encryption
brew "age"
brew "gpg"

# Language version managers
brew "mise"

# CLI Tools
brew "yq"
brew "jq"
brew "zoxide"
brew "bat"

# Development
brew "lazygit"
brew "tmux"

# Shell & prompt
brew "fish"
brew "starship"

# Kubernetes / DevOps
brew "kubectl"
brew "k9s"
brew "awscli"

# Productivity
brew "neovim"

# Window Management & Status Bar
cask "nikitabobko/tap/aerospace"
brew "sketchybar"
brew "borders"
brew "koekeishiya/formulae/skhd"

# Developer tools
cask "visual-studio-code"
cask "jetbrains-toolbox"
cask "goland"
cask "pycharm"

# Developer languages
brew "lua"

# Casks
cask "arc"
cask "raycast"
cask "maccy"
cask "docker"
cask "font-hack-nerd-font"
cask "sf-symbols"
cask "ghostty"
cask "logi-options+"
